{
 "cells": [
  {
   "cell_type": "code",
   "source": [
    "\"\"\" Автомат получает на вход трёхзначное число. По этому числу строится новое число по следующим правилам.\n",
    "1.Складываются первая и вторая, а также вторая и третья цифры исходного числа.\n",
    "2.Полученные два числа записываются друг за другом в порядке убывания (без разделителей).\n",
    "\n",
    "Пример. Исходное число: 348. Суммы: 3+4=7; 4+8=12. \n",
    "\n",
    "Результат: 127. \n",
    "\n",
    "Укажите наименьшее число, в результате обработки которого автомат выдаст число 1412. \n",
    "https://inf-ege.sdamgia.ru/problem?id=7663\n",
    "\"\"\"\n",
    "# Вариант решения c использованием функции\n",
    "\n",
    "\n",
    "def myresult(i):\n",
    "    stroka = str(i)\n",
    "    num1 = int(stroka[0])+int(stroka[1])\n",
    "    num2 = int(stroka[1])+int(stroka[2])\n",
    "    first = max(num1, num2)\n",
    "    second = min(num1, num2)\n",
    "    result = str(first) + str(second)\n",
    "    if result == '1412':\n",
    "        return True\n",
    "\n",
    "    return False\n",
    "\n",
    "\n",
    "# Можно наполнить список всеми подходящими и найти минимум\n",
    "nums = []\n",
    "\n",
    "for i in range(100, 1000):\n",
    "    if myresult(i):\n",
    "        nums.append(i)\n",
    "print(min(nums))\n",
    "\n",
    "\n",
    "# # Вариант решения без использования функции\n",
    "# for i in range(100,1000):\n",
    "\n",
    "#     stroka = str(i)\n",
    "#     num1 = int(stroka[0])+int(stroka[1])\n",
    "#     num2 = int(stroka[1])+int(stroka[2])\n",
    "#     first = max(num1, num2)\n",
    "#     second = min(num1, num2)\n",
    "#     result = str(first) + str(second)\n",
    "\n",
    "#     if result == '1412':\n",
    "#         nums.append(i)\n",
    "# print(nums)\n",
    "# print(sorted(nums))"
   ]
  },
  {
   "cell_type": "code",
   "source": [
    "# На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.\n",
    "# 1.  Строится двоичная запись числа N.\n",
    "# 2.  К этой записи дописываются справа ещё несколько разрядов по следующему правилу:\n",
    "# а) если N чётное, то к нему справа приписываются два нуля, а слева единица;\n",
    "# б) если N нечётное, то к нему справа приписывается в двоичном виде сумма цифр его двоичной записи;\n",
    "# Полученная таким образом запись (в ней как минимум на один разряд больше, чем в записи исходного числа N) является двоичной записью искомого числа R.\n",
    "# Например, исходное число 4(10)=100(2) преобразуется в число 110000(2)=48101100002=48(10),\n",
    "# Укажите такое число N, для которого число R является наименьшим среди чисел, превышающих 190. В ответе это число запишите в десятичной системе счисления\n",
    "\n",
    "def myFunc(N):\n",
    "    # получаем двоичную запись числа\n",
    "    b = str(bin(N)[2:])\n",
    "    if N % 2 == 0:\n",
    "        b ='1' + b + '00'\n",
    "    else:\n",
    "        sum = 0\n",
    "        for j in b:\n",
    "            sum += int(j)\n",
    "        b = b + str(bin(sum)[2:])\n",
    "\n",
    "    b = int(b, 2)\n",
    "\n",
    "    return b\n",
    "\n",
    "res = []\n",
    "for i in range(1, 1000):\n",
    "    R = myFunc(i)\n",
    "    if R > 190:\n",
    "        res.append(R)\n",
    "        print(f'i = {i} R = {R}')\n",
    "    # if R == 192:\n",
    "    #     print(f'i = {i} R = {R}')\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "print(min(res))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.8"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
