{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[334, 325, 317, 313, 310, 301, 293, 286, 277, 269, 265, 262, 253, 245, 238, 229, 221, 217, 214, 205, 197, 190, 173, 166, 149, 142, 125, 121, 118, 109, 101, 94, 85, 77, 73, 70, 61, 53, 46, 29, 25, 22, 13, 5]\n",
      "334\n"
     ]
    }
   ],
   "source": [
    "\"\"\" Шастин Л.\n",
    "На вход алгоритма подаётся нечётное натуральное число N. Алгоритм строит по нему новое число R следующим образом.\n",
    "\n",
    "Строится четверичная запись числа N.\n",
    "Далее эта запись обрабатывается по следующему правилу:\n",
    "а) если число N делится на 3, то первая и последняя цифры меняются местами, а затем в конец дописывается единица;\n",
    "б) если число N на 3 не делится, то остаток от деления на 3 дописывается в конец числа.\n",
    "Полученная таким образом запись является четверичной записью искомого числа R.\n",
    "Результат переводится в десятичную систему и выводится на экран.\n",
    "Например, для исходного числа 11 = 23(4)\n",
    "результатом является число 232(4) = 46, а для исходного числа 13 = 31(4)\n",
    "это число 311(4) = 53\n",
    "Укажите максимальное число R, не превышающее 340, которое может быть получено с помощью описанного алгоритма.\n",
    "\n",
    "В ответе запишите это число в десятичной системе счисления \"\"\"\n",
    "\n",
    "# функция перевода в 4-ю систему исчисления\n",
    "\n",
    "\n",
    "def to_4(n):\n",
    "    s = \"\"\n",
    "    # будем делать цикл пока n больше нуля...\n",
    "    while (n > 0):\n",
    "        # считаем остаток от деления на 4 (в случае 7-чной системы на 7)\n",
    "        ostatok = n % 4\n",
    "        # а к самой n применяем деление без остатка\n",
    "        n = n // 4\n",
    "        # делаем новую строку из остаков от деления\n",
    "        s += str(ostatok)\n",
    "\n",
    "    return s[::-1]\n",
    "\n",
    "\n",
    "def F(n):\n",
    "    n_4 = to_4(n)\n",
    "    s = str(n_4)  # делаем строку из числа\n",
    "    r = ''\n",
    "    if n % 3 == 0:\n",
    "        if len(s) > 1:\n",
    "            r = s[-1]+s[1:-1]+s[0]+'1'\n",
    "        else:\n",
    "            r = s+'1'\n",
    "    else:\n",
    "            r = s + str(n % 3)\n",
    "\n",
    "    return int(r, 4)\n",
    "\n",
    "res = []\n",
    "for i in range(1, 100000, 2):\n",
    "    if F(i)<=340:\n",
    "        res.append(F(i))\n",
    "        # print(f'i = {i} F(i) = {F(i)}')\n",
    "\n",
    "print(sorted(res, reverse=True))\n",
    "print(max(res))\n",
    "\n",
    "# print(f'i = {i} F(i) = {F(i)} 10 = {int(F(i), 4)}')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\" Автомат получает на вход трёхзначное число. По этому числу строится новое число по следующим правилам.\n",
    "1.Складываются первая и вторая, а также вторая и третья цифры исходного числа.\n",
    "2.Полученные два числа записываются друг за другом в порядке убывания (без разделителей).\n",
    "\n",
    "Пример. Исходное число: 348. Суммы: 3+4=7; 4+8=12. \n",
    "\n",
    "Результат: 127. \n",
    "\n",
    "Укажите наименьшее число, в результате обработки которого автомат выдаст число 1412. \n",
    "https://inf-ege.sdamgia.ru/problem?id=7663\n",
    "\"\"\"\n",
    "# Вариант решения c использованием функции\n",
    "\n",
    "\n",
    "def myresult(i):\n",
    "    stroka = str(i)\n",
    "    num1 = int(stroka[0])+int(stroka[1])\n",
    "    num2 = int(stroka[1])+int(stroka[2])\n",
    "    first = max(num1, num2)\n",
    "    second = min(num1, num2)\n",
    "    result = str(first) + str(second)\n",
    "    if result == '1412':\n",
    "        return True\n",
    "\n",
    "    return False\n",
    "\n",
    "\n",
    "# Можно наполнить список всеми подходящими и найти минимум\n",
    "nums = []\n",
    "\n",
    "for i in range(100, 1000):\n",
    "    if myresult(i):\n",
    "        nums.append(i)\n",
    "print(min(nums))\n",
    "\n",
    "\n",
    "# # Вариант решения без использования функции\n",
    "# for i in range(100,1000):\n",
    "\n",
    "#     stroka = str(i)\n",
    "#     num1 = int(stroka[0])+int(stroka[1])\n",
    "#     num2 = int(stroka[1])+int(stroka[2])\n",
    "#     first = max(num1, num2)\n",
    "#     second = min(num1, num2)\n",
    "#     result = str(first) + str(second)\n",
    "\n",
    "#     if result == '1412':\n",
    "#         nums.append(i)\n",
    "# print(nums)\n",
    "# print(sorted(nums))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.\n",
    "# 1.  Строится двоичная запись числа N.\n",
    "# 2.  К этой записи дописываются справа ещё несколько разрядов по следующему правилу:\n",
    "# а) если N чётное, то к нему справа приписываются два нуля, а слева единица;\n",
    "# б) если N нечётное, то к нему справа приписывается в двоичном виде сумма цифр его двоичной записи;\n",
    "# Полученная таким образом запись (в ней как минимум на один разряд больше, чем в записи исходного числа N) является двоичной записью искомого числа R.\n",
    "# Например, исходное число 4(10)=100(2) преобразуется в число 110000(2)=48101100002=48(10),\n",
    "# Укажите такое число N, для которого число R является наименьшим среди чисел, превышающих 190. В ответе это число запишите в десятичной системе счисления\n",
    "\n",
    "def myFunc(N):\n",
    "    # получаем двоичную запись числа\n",
    "    b = str(bin(N)[2:])\n",
    "    if N % 2 == 0:\n",
    "        b ='1' + b + '00'\n",
    "    else:\n",
    "        sum = 0\n",
    "        for j in b:\n",
    "            sum += int(j)\n",
    "        b = b + str(bin(sum)[2:])\n",
    "\n",
    "    b = int(b, 2)\n",
    "\n",
    "    return b\n",
    "\n",
    "res = []\n",
    "\n",
    "for i in range(1, 10000):\n",
    "    R = myFunc(i)\n",
    "    if R > 190:\n",
    "        # print(f'i = {i} R = {R}')\n",
    "        res.append(R)\n",
    "\n",
    "print(min(res))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.6"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
