{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "ip = [192, 168, 10, 66] \n",
    "\n",
    "s0 = [bin(x)[2:]  for x in ip]\n",
    "s1 = [f'{x:0>8}'  for x in s0]\n",
    "\n",
    "s2 = []\n",
    "for x in s0:\n",
    "    y = f'{x:0>8}'\n",
    "    s2.append(y)\n",
    "\n",
    "\n",
    "print(s0)\n",
    "print(s1)\n",
    "print(s2)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая — к адресу узла в этой сети. Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и маске сети.\n",
    "\n",
    "Сеть задана IP-адресом 123.222.0.192 и маской сети 255.255.255.224. Сколько в этой сети IP-адресов, в которых количество нулей и единиц в двоичной записи IP-адреса одинаково? В ответе укажите только число."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from ipaddress import *  # Импортируем только нужную функцию\n",
    "\n",
    "# Создаем объект сети с указанным адресом и маской\n",
    "net1 = ip_network('123.222.0.192/255.255.255.224', strict=True)\n",
    "ip_a = ip_address('123.222.0.192')\n",
    "\n",
    "print(ip_a)\n",
    "print(bin(int(ip_a))[2:])\n",
    "# Выводим все хосты в сети\n",
    "# print(*net1.hosts())\n",
    "\n",
    "# Инициализируем счетчик для подсчета хостов с равным количеством единиц и нулей в бинарном представлении\n",
    "k = 0\n",
    "\n",
    "# Перебираем все хосты в сети\n",
    "for x in net1.hosts():\n",
    "    # Преобразуем IP-адрес в 32-битное бинарное представление\n",
    "    n = bin(int(x))[2:]  # Используем zfill для заполнения нулями до 32 бит\n",
    "    # Проверяем, равно ли количество единиц количеству нулей\n",
    "    if n.count('1') == n.count('0'):\n",
    "        k += 1  # Увеличиваем счетчик, если условие выполняется\n",
    "\n",
    "# Выводим результат\n",
    "print(k)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая — к адресу узла в этой сети. Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и маске сети.\n",
    "\n",
    "Сеть задана IP-адресом 172.16.168.0 и маской сети 255.255.248.0.\n",
    "\n",
    "Сколько в этой сети IP-адресов, для которых количество единиц в двоичной записи IP-адреса не кратно 5?\n",
    "\n",
    "В ответе укажите только число."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "172.16.168.0\n",
      "10101100000100001010100000000000\n",
      "11111111111111111111100000000000\n",
      "172.16.168.0\n",
      "172.16.168.255\n",
      "218\n"
     ]
    }
   ],
   "source": [
    "from ipaddress import *  \n",
    "\n",
    "network = ip_network('172.16.168.0/255.255.255.0', strict=False)\n",
    "\n",
    "ip_a = ip_address('172.16.168.0')\n",
    "ip_m = ip_address('255.255.248.0')\n",
    "\n",
    "print(ip_a)\n",
    "print(bin(int(ip_a))[2:])\n",
    "print(bin(int(ip_m))[2:])\n",
    "\n",
    "# Счетчик для адресов, где количество единиц не кратно 5\n",
    "count = 0\n",
    "\n",
    "# Перебираем все хосты в сети\n",
    "# Метод hosts() возвращает итератор всех хостов в сети (исключая сетевой и широковещательный адреса).\n",
    "print(network.network_address)  # адрес сети\n",
    "print(network.broadcast_address)  # широковещательный адрес.\n",
    "\n",
    "for ip in network.hosts():\n",
    "    # Преобразуем IP-адрес в двоичную строку\n",
    "    binary_ip = bin(int(ip))[2:].zfill(32)\n",
    "    # Считаем количество единиц\n",
    "    ones_count = binary_ip.count('1')\n",
    "    # Проверяем, не кратно ли 5\n",
    "    if ones_count % 5 != 0:\n",
    "        count += 1\n",
    "\n",
    "# Выводим результат\n",
    "print(count)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
