{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\" Исполнитель Редактор получает на вход строку цифр и преобразовывает её. Редактор может выполнять две команды, в обеих командах v и w обозначают цепочки цифр.\n",
    "\n",
    "А) заменить (v, w).\n",
    "\n",
    "Эта команда заменяет в строке первое слева вхождение цепочки v на цепочку w. Например, выполнение команды\n",
    "\n",
    "заменить (111, 27)\n",
    "\n",
    "преобразует строку 05111150 в строку 0527150.\n",
    "\n",
    "Если в строке нет вхождений цепочки v, то выполнение команды\n",
    "\n",
    "заменить (v, w)\n",
    "\n",
    "не меняет эту строку.\n",
    "\n",
    "Б) нашлось (v).\n",
    "\n",
    "Эта команда проверяет, встречается ли цепочка v в строке исполнителя Редактор. Если она встречается, то команда возвращает логическое значение «истина», в противном случае возвращает значение «ложь». Строка исполнителя при этом не изменяется.\n",
    "\n",
    "Цикл\n",
    "\n",
    "ПОКА условие \n",
    "    последовательность команд\n",
    "КОНЕЦ ПОКА\n",
    "выполняется, пока условие истинно.\n",
    "\n",
    "В конструкции\n",
    "\n",
    "ЕСЛИ  условие\n",
    "     ТО команда1\n",
    "     ИНАЧЕ команда2\n",
    "КОНЕЦ ЕСЛИ\n",
    "выполняется команда1 (если условие истинно) или команда2 (если условие ложно).\n",
    "\n",
    "Дана программа для Редактора:\n",
    "\n",
    "НАЧАЛО\n",
    "ПОКА нашлось (52) ИЛИ нашлось (2222) ИЛИ нашлось (1122)\n",
    " ЕСЛИ нашлось (52)\n",
    "   ТО заменить (52, 11)\n",
    " КОНЕЦ ЕСЛИ\n",
    " ЕСЛИ нашлось (2222)\n",
    "   ТО заменить (2222, 5)\n",
    " КОНЕЦ ЕСЛИ\n",
    " ЕСЛИ нашлось (1122)\n",
    "   ТО заменить (1122, 25)\n",
    " КОНЕЦ ЕСЛИ\n",
    "КОНЕЦ ПОКА\n",
    "КОНЕЦ\n",
    "На вход приведённой выше программе поступает строка, начинающаяся с цифры «5», а затем содержащая n цифр «2» (\n",
    "3\n",
    " \n",
    "<\n",
    " \n",
    "n\n",
    " \n",
    "<\n",
    " \n",
    "10\n",
    " \n",
    "000\n",
    "3 < n < 10 000).\n",
    "\n",
    "Определите наибольшее значение n, при котором сумма цифр в строке, получившейся в результате выполнения программы, равна 64. \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "for n in range(10000, 3, -1):\n",
    "  s = '5' + '2' * n \n",
    "  while ('52' in s) or ('2222' in s) or ('1122' in s):\n",
    "    if '52' in s:\n",
    "      s = s.replace('52', '11')\n",
    "    if '2222' in s:\n",
    "      s = s.replace('2222', '5')\n",
    "    if '1122' in s:\n",
    "      s = s.replace('1122', '25')\n",
    "    s1 = list(s)\n",
    "\n",
    "    k = 0\n",
    "    s1 = list(s)\n",
    "    for i in range(len(s1)):\n",
    "      k += int(s1[i])\n",
    "      if k == 64:\n",
    "        print(n)\n",
    "        break\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.8"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
