{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Текстовый файл состоит не более, чем из 10⁶ символов из набора A, B, C, D, E, F.\n",
    "\n",
    "Найдите максимальную длину строки вида А*А*А*А, где между буквами А расположены одинаковые группы символов, не содержащие букв А. Например, в строке BDADBADBADBABDAFABDA такая подстрока ADBADBADBA (длина 10).\n",
    "\n",
    "Для выполнения этого задания следует написать программу."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "text_string = open('files/24.txt').readline()\n",
    "split_text = text_string.split('A')\n",
    "\n",
    "max_value = -float('inf')\n",
    "\n",
    "for a, b, c in zip(split_text, split_text[1:], split_text[2:]):\n",
    "    if a == b == c:\n",
    "        max_value = max(max_value,len(c*3))\n",
    "\n",
    "\n",
    "res = max_value + 4\n",
    "print(res)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Разберём ваш код построчно:\n",
    "\n",
    "---\n",
    "\n",
    "### 1. `text_string = open('files/24.txt').readline()`\n",
    "- Эта строка открывает файл `24\\.txt`, который находится в папке `files`, и читает первую строку из этого файла.\n",
    "- Результат (первая строка файла) сохраняется в переменную `text_string`.\n",
    "\n",
    "---\n",
    "\n",
    "### 2. `split_text = text_string.split('A')`\n",
    "- Здесь строка `text_string` разбивается на список подстрок с помощью разделителя `'A'`.\n",
    "- Например, если `text_string = \"BACADAEA\"`, то `split_text` будет равен `['B', 'C', 'D', 'E']`.\n",
    "- Результат сохраняется в переменную `split_text`.\n",
    "\n",
    "---\n",
    "\n",
    "### 3. `print(split_text)`\n",
    "- Выводит содержимое списка `split_text` на экран. Это нужно для отладки или проверки промежуточного результата.\n",
    "\n",
    "---\n",
    "\n",
    "### 4. `max_value = -float('inf')`\n",
    "- Создаётся переменная `max_value`, которая инициализируется значением \"минус бесконечность\".\n",
    "- Это нужно для того, чтобы в дальнейшем можно было корректно сравнивать длины строк и находить максимальное значение.\n",
    "\n",
    "---\n",
    "\n",
    "### 5. `for a, b, c in zip(split_text, split_text[1:], split_text[2:]):`\n",
    "- Здесь используется цикл `for`, который проходит по тройкам элементов списка `split_text`.\n",
    "- `zip(split_text, split_text[1:], split_text[2:])` создаёт итератор, который группирует элементы списка по три:\n",
    "  - `a` — текущий элемент,\n",
    "  - `b` — следующий элемент,\n",
    "  - `c` — элемент через один.\n",
    "- Например, если `split_text = ['B', 'C', 'D', 'E']`, то на первой итерации:\n",
    "  - `a = 'B'`, `b = 'C'`, `c = 'D'`.\n",
    "\n",
    "---\n",
    "\n",
    "### 6. `if a == b == c:`\n",
    "- Проверяется, равны ли все три элемента (`a`, `b`, `c`).\n",
    "- Если они равны, выполняется блок кода внутри условия.\n",
    "\n",
    "---\n",
    "\n",
    "### 7. `max_value = max(max_value, len(c * 3))`\n",
    "- Если условие `a == b == c` выполняется, то вычисляется длина строки, полученной умножением `c` на 3 (например, если `c = 'X'`, то `c * 3 = 'XXX'`).\n",
    "- Затем с помощью функции `max` выбирается большее значение между текущим `max_value` и длиной этой строки.\n",
    "- Результат сохраняется в переменную `max_value`.\n",
    "\n",
    "---\n",
    "\n",
    "### 8. `res = max_value + 4`\n",
    "- После завершения цикла вычисляется итоговый результат `res`, который равен `max_value + 4`.\n",
    "- Число `4` добавлено, вероятно, для учёта символов `'A'`, которые были удалены при разбиении строки.\n",
    "\n",
    "---\n",
    "\n",
    "### 9. `print(res)`\n",
    "- Выводит итоговое значение `res` на экран.\n",
    "\n",
    "---\n",
    "\n",
    "### Что делает этот код?\n",
    "Код анализирует строку из файла, разбивает её по символу `'A'`, ищет три подряд идущих одинаковых фрагмента и вычисляет максимальную длину таких фрагментов, увеличенную на 4.\n",
    "\n",
    "---\n",
    "\n",
    "Если у вас есть дополнительные вопросы или нужно что-то уточнить, дайте знать! 😊"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.6"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
